spec/fixtures/personal_information_wizard.dot
digraph PersonalInformationWizard {
rankdir = "LR";
fontname = "Arial";
node[ style  =  "rounded" , shape  =  "rect"];
edge[ fontname  =  "Arial"];
name_and_date_of_birth [label = "Name And Date Of Birth"];
nationality [label = "Nationality"];
right_to_work_or_study [label = "Right To Work Or Study"];
immigration_status [label = "Immigration Status"];
review [label = "Review"];
  name_and_date_of_birth -> nationality [style = "bold"];
  immigration_status -> review [style = "bold"];
  nationality -> right_to_work_or_study [label = "Non-UK/Irish", color = "#00703c"];
  nationality -> review [label = "Else", color = "#d4351c"];
  right_to_work_or_study -> immigration_status [label = "Right to work or study?", color = "#00703c"];
  right_to_work_or_study -> review [label = "Else", color = "#d4351c"];
}
